--[[▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀          by: #dev @MRdero       ▀▄ ▄▀  
▀▄ ▄▀             #dev @awose         ▀▄ ▄▀                  
▀▄ ▄▀           #dev @www_xnxx_c0m    ▀▄ ▄▀                
▀▄ ▄▀                                 ▀▄ ▄▀                
▀                 sors"alathad"       ▀▄ ▄▀
▀▄ ▄▀                name:            ▀▄ ▄▀ 
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄]]

do
local function run(msg,matches)
if not is_momod(msg) then 
  return "🙇🏻 عذرا "..msg.from.first_name.."\n"
  .."🚀للمدراء فقط  "
    end
if is_momod(msg) then 
  return "مرحبا عزيزي  🔮 "..msg.from.first_name.."\n"
  .."🚀اسم المجموعة  : ".."\n"..msg.to.title.."\n"
  .."  ".."\n"
  ..[[
اوامر الحذف في المجموعة 🕹
تعمل جميع لاوامر ب {/!#} 💡 
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹  
📊/unban     : لحذف المحضورين 🕹
📊/unbanall : لحذف المحضورين عام
📊/حذف الكلمات المحضورة : لحذف الكلمات المحضورة 🕹
📊/حذف الوصف : لحذف الوصف 🕹
📊/حذف القوانين : لحذف القوانين 🕹
📊/حذف المعرف : لحذف المعرف 🕹
📊/حذف قائمة الاسكات : لحذف المكتومين 🕹
📊/حذف الاداريين : لحذف الادمنية 🕹
📊حذف (العدد) : لحذف الرسائل🕹 
📊منع (الكلمة) : لمنع الكلمة في المجموعة🕹
📊الغاء منع (الكلمة) : لألغاء منع الكلمة في المجموعة🕹
📊قائمة المنع : لرؤية الكلمات الممنوعة في المجموعة🕹
📊حذف قائمة المنع : لحذف جميع الكلمات الممنوعة في المجموعة🕹


]].."\n"
.."➖➖➖➖➖➖➖➖".."\n"
.."المطورين #dev @www_xnxx_c0m #dev @Mrdero #dev @awose ".."\n"
.."📛قناتنا : @GOLDEN0DIVA ".."\n"
.."🔶التاريخ : "..os.date('%A, %B, %d, %Y\n' , timestamp)
.."➖➖➖➖➖➖➖➖".."\n"
.."🔹الوقت : "..os.date(' %T', os.time()).."\n"
   end
end
  
  return  {
    patterns = {
      "^[!/#](اوامر3)"
},
  run = run,
}
end