--[[▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀          by: #dev @MRdero       ▀▄ ▄▀  
▀▄ ▄▀             #dev @awose         ▀▄ ▄▀                  
▀▄ ▄▀           #dev @www_xnxx_c0m    ▀▄ ▄▀                
▀▄ ▄▀                                 ▀▄ ▄▀                
▀                 sors"alathad"       ▀▄ ▄▀
▀▄ ▄▀                name:            ▀▄ ▄▀ 
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄ ▄▀                                 ▀▄ ▄▀
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄]]

do
local function run(msg,matches)
if not is_momod(msg) then 
  return "🙇🏻 عذرا "..msg.from.first_name.."\n"
  .."🚀للمدراء فقط  "
    end
if is_momod(msg) then 
  return "مرحبا عزيزي 🔮 "..msg.from.first_name.."\n"
  .."🚀اسم المجموعة  : ".."\n"..msg.to.title.."\n"
  .."  ".."\n"
  ..[[
اوامر الطرد المجموعة 🕹
تعمل جميع لاوامر ب {/!#} 💡
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹  
📊/ban : لحضر عضو 🕹
📊/kick : لطرد عضو 🕹
📊/الغاء الحضر : لالغاء الحضر 🕹
📊/اسكت : لكتم عضو 🕹
📊/حضر كلمة : لحضر كلمة 🕹
📊/الغاء حضرها : لالغاء حضر كلمة 🕹
📊/اسكت : لالغاء كتم 🕹
📊/حضر : لحضر كلمة 🕹
📊/دعبلني : للخروج من المجموعة 🕹
📊/المحضورين : لاضهار المحضورين 🕹


 ]].."\n"
.."➖➖➖➖➖➖➖➖".."\n"
.."📛قناتنا : @GOLDEN0DIVA  ".."\n"
.."المطورين #dev @www_xnxx_c0m #dev @Mrdero #dev @awose ".."\n"
.."🔶التاريخ : "..os.date('%A, %B, %d, %Y\n' , timestamp)
.."➖➖➖➖➖➖➖➖".."\n"
.."🔹الوقت : "..os.date(' %T', os.time()).."\n"
   end
end
  
  return  {
    patterns = {
      "^[!/#](اوامر4)"
},
  run = run,
}
end